important numbers:
Original U-net has: (Fully convoltional NN)
Total params: 31,031,875
Trainable params: 31,031,875
Non-trainable params: 0


U-net training:
Last few iterations:
Epoch 69/200
704/720 [============================>.] - ETA: 0s - loss: 305.2103 - accuracy: 0.8355
Epoch 00069: val_loss did not improve from 300.90300
720/720 [==============================] - 3s 5ms/sample - loss: 305.4473 - accuracy: 0.8353 - val_loss: 313.4054 - val_accuracy: 0.7901
Epoch 70/200
704/720 [============================>.] - ETA: 0s - loss: 305.0035 - accuracy: 0.8362
Epoch 00070: val_loss did not improve from 300.90300
720/720 [==============================] - 3s 5ms/sample - loss: 305.2634 - accuracy: 0.8361 - val_loss: 315.7377 - val_accuracy: 0.7849
Epoch 71/200
704/720 [============================>.] - ETA: 0s - loss: 305.2316 - accuracy: 0.8355
Epoch 00071: val_loss did not improve from 300.90300
720/720 [==============================] - 3s 5ms/sample - loss: 305.0965 - accuracy: 0.8354 - val_loss: 317.8433 - val_accuracy: 0.7850
Epoch 72/200
704/720 [============================>.] - ETA: 0s - loss: 305.7314 - accuracy: 0.8312
Epoch 00072: val_loss did not improve from 300.90300
720/720 [==============================] - 3s 5ms/sample - loss: 305.0078 - accuracy: 0.8317 - val_loss: 319.3285 - val_accuracy: 0.7900

This U net arachtecture
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 128, 128, 3) 0                                            
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 128, 128, 3)  0           input_2[0][0]                    
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 128, 128, 16) 448         lambda_1[0][0]                   
__________________________________________________________________________________________________
dropout_9 (Dropout)             (None, 128, 128, 16) 0           conv2d_17[0][0]                  
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 128, 128, 16) 2320        dropout_9[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 64, 64, 16)   0           conv2d_18[0][0]                  
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 64, 64, 32)   4640        max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
dropout_10 (Dropout)            (None, 64, 64, 32)   0           conv2d_19[0][0]                  
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 64, 64, 32)   9248        dropout_10[0][0]                 
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 32, 32, 32)   0           conv2d_20[0][0]                  
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 32, 32, 64)   18496       max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
dropout_11 (Dropout)            (None, 32, 32, 64)   0           conv2d_21[0][0]                  
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 32, 32, 64)   36928       dropout_11[0][0]                 
__________________________________________________________________________________________________
max_pooling2d_6 (MaxPooling2D)  (None, 16, 16, 64)   0           conv2d_22[0][0]                  
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 16, 16, 128)  73856       max_pooling2d_6[0][0]            
__________________________________________________________________________________________________
dropout_12 (Dropout)            (None, 16, 16, 128)  0           conv2d_23[0][0]                  
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 16, 16, 128)  147584      dropout_12[0][0]                 
__________________________________________________________________________________________________
max_pooling2d_7 (MaxPooling2D)  (None, 8, 8, 128)    0           conv2d_24[0][0]                  
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 8, 8, 256)    295168      max_pooling2d_7[0][0]            
__________________________________________________________________________________________________
dropout_13 (Dropout)            (None, 8, 8, 256)    0           conv2d_25[0][0]                  
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 8, 8, 256)    590080      dropout_13[0][0]                 
__________________________________________________________________________________________________
conv2d_transpose_4 (Conv2DTrans (None, 16, 16, 128)  131200      conv2d_26[0][0]                  
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 16, 16, 256)  0           conv2d_transpose_4[0][0]         
                                                                 conv2d_24[0][0]                  
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 16, 16, 128)  295040      concatenate_4[0][0]              
__________________________________________________________________________________________________
dropout_14 (Dropout)            (None, 16, 16, 128)  0           conv2d_27[0][0]                  
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 16, 16, 128)  147584      dropout_14[0][0]                 
__________________________________________________________________________________________________
conv2d_transpose_5 (Conv2DTrans (None, 32, 32, 64)   32832       conv2d_28[0][0]                  
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 32, 32, 128)  0           conv2d_transpose_5[0][0]         
                                                                 conv2d_22[0][0]                  
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, 32, 32, 64)   73792       concatenate_5[0][0]              
__________________________________________________________________________________________________
dropout_15 (Dropout)            (None, 32, 32, 64)   0           conv2d_29[0][0]                  
__________________________________________________________________________________________________
conv2d_30 (Conv2D)              (None, 32, 32, 64)   36928       dropout_15[0][0]                 
__________________________________________________________________________________________________
conv2d_transpose_6 (Conv2DTrans (None, 64, 64, 32)   8224        conv2d_30[0][0]                  
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 64, 64, 64)   0           conv2d_transpose_6[0][0]         
                                                                 conv2d_20[0][0]                  
__________________________________________________________________________________________________
conv2d_31 (Conv2D)              (None, 64, 64, 32)   18464       concatenate_6[0][0]              
__________________________________________________________________________________________________
dropout_16 (Dropout)            (None, 64, 64, 32)   0           conv2d_31[0][0]                  
__________________________________________________________________________________________________
conv2d_32 (Conv2D)              (None, 64, 64, 32)   9248        dropout_16[0][0]                 
__________________________________________________________________________________________________
conv2d_transpose_7 (Conv2DTrans (None, 128, 128, 16) 2064        conv2d_32[0][0]                  
__________________________________________________________________________________________________
concatenate_7 (Concatenate)     (None, 128, 128, 32) 0           conv2d_transpose_7[0][0]         
                                                                 conv2d_18[0][0]                  
__________________________________________________________________________________________________
conv2d_33 (Conv2D)              (None, 128, 128, 16) 4624        concatenate_7[0][0]              
__________________________________________________________________________________________________
dropout_17 (Dropout)            (None, 128, 128, 16) 0           conv2d_33[0][0]                  
__________________________________________________________________________________________________
conv2d_34 (Conv2D)              (None, 128, 128, 16) 2320        dropout_17[0][0]                 
__________________________________________________________________________________________________
conv2d_35 (Conv2D)              (None, 128, 128, 3)  51          conv2d_34[0][0]                  
==================================================================================================
Total params: 1,941,139
Trainable params: 1,941,139
Non-trainable params: 0
__________________________________________________________________________________________________
Train on 720 samples, validate on 80 samples







